label act2:
    play music "bird-chirping-sound-effect.mp3" loop fadein 0.3 volume 0.3
    if b_love == 1:
        jump bob_morning
    jump morning

label morning:
    scene bedroom with Fade(0.5,1.0,0.5)
    player "看來今天也是美好的一天呢！"
    scene classroom with Fade(0.5,1.0,0.5)
    play music "snowdin-town.mp3" loop volume 0.5
    "[player]來到了教室"
    show s norm with dissolve
    player "碩碩，早安"
    s "！"
    "碩碩突然抬起頭來"
    "看到是你，似乎鬆了一口氣"
    s "早……早安"
    hide s norm with dissolve
    show w norm with dissolve:
            zoom 0.6
            yalign 1.5
            xalign 0.5
    w "嘿哥們！早啊！"
    player "勝勝！早啊"
    w "我等等有比賽，等等記得來看我！"
    "經勝勝提醒，你想起來今天上午似乎是校園認識活動"
    "學生們可以到處參觀、走訪校園"
    player "必須的"
    "勝勝飛快地離開了教室"
    hide w norm with dissolve
    "此時，Alex恰巧進來了教室"
    show a norm with dissolve
    "空氣中彷彿多了一點莓果的香氣，使你整個人都清爽了起來"
    player "啊，Alex，早安"
    a "早啊，[player]"
    hide a norm with dissolve
    player "離活動開始還有一段時間，稍微睡一下好了……"
    "你睡了一覺，精神似乎變好了"
    "醒來後，教室裡的人已經寥寥無幾"
    player "我也去逛逛學校好了。"

label choose_scene:
    player "接下來我該去哪呢？"
    menu:
        "去球場看看":
            jump w_soccer
        "去圖書室看看":
            jump a_reading
        "隨處晃晃":
            jump s_cat

label w_soccer:
    "你慢慢靠近球場，人開始多了起來"
    "許多新生聚集到了此處，觀看著高年級的學生們揮灑汗水"
    "不遠處的足球場旁更是擠滿了人"
    player "足球？我記得勝勝好像有比賽的樣子，過去看看吧。"
    "你使盡全力，才稍微擠進那群學生中"
    "仔細一看，勝勝正快速地在球場上穿梭"
    player "對面選手的有穿學校球衣，應該都是高年級吧？"
    "儘管對手是高年級，勝勝仍不落下風"
    "他敏捷的動作令所有人為之驚嘆，精準的傳球驚詫了周邊的所有人"
    "很快，勝勝便找到了機會，一發射門——"
    "如此刺激，使你險些忘記了呼吸"
    "完美的倒鉤！全場立刻爆發出歡呼聲"
    player "勝勝！太帥了！"
    "勝勝聽見你的聲音，眼神立即與你對上"
    "他露出了燦爛的笑容，你懷疑，那光芒能夠與太陽比肩"
    "比賽在歡聲中落幕，勝勝所帶領的隊伍毫無疑問拿下了勝利"
    "人群漸漸散開，勝勝在此時找到了你"
    w "[player]！你覺得我剛剛那一球怎麼樣！"
    menu:
        "帥麻了，可惜不能再站近一點。":
            w "讚啦，就知道你會喜歡！"
            w "以後隨時都可以來找我，有機會也教你踢球！"
            $ w_love += 1
        "還不賴。":
            w "謝啦。"
            w "以後有機會也來踢球吧。"
    "你們之間的話題不斷，大部分是有關運動的"
    "還有肌肉、女僕跟電動"
    "談話間，勝勝突然拉著你往旁邊一步"
    "飛身向前、為你擋住了天外飛來的排球"
    npc_black "對不起！沒注意力道"
    w "沒事，我們都沒有受傷"
    "勝勝回頭望向你，似乎在等待著你說些什麼"
    menu:
        "謝謝勝勝！嚇死我了！":
            "勝勝的臉微微泛紅，你們之間僵住了一小會兒"
            w "沒……沒事就好"
            $ w_love += 1
        "我去，這球有夠危險。":
            w "……沒事就好！"
    "你們一起參觀了許多運動社團"
    npc_tall "歡迎加入籃球隊喔！"
    npc_glasses "不介意的話，可以來桌球部看看喔……"
    "學生們的吆喝聲此起彼落"
    "勝勝似乎很喜歡這種熱鬧的氣氛"
    "你的嘴角也不自覺上揚了些"
    "你們漫步在運動場上，有時被勝勝拉走、去看看一些有趣的攤子"
    "有時只是單純聊著天"
    "你們最後坐在了足球場旁的板凳上，這時，勝勝不知從哪裡搞來了一顆足球"
    "他將球頂在頭上，秀著一些你看不懂的技巧與招式"
    "看起來有些滑稽，但你知道，這些動作絕不是簡簡單單能辦到的"
    w "[player]還有一些時間，你要來體驗一下足球嗎？"
    menu:
        "打！肯定打！":
            w "這就對了！"
            "勝勝將你一把拉起，興高采烈地跟你介紹起了簡單的動作與腳法"
            "你有些不適應，但勝勝耐心地在一旁指導你"
            "過了一段時間，你也開始能夠做出基本的踢、傳球了"
            "你與勝勝在炎熱的太陽下踢著球"
            "彷彿忽視了旁人"
            "世界好像只剩下你們兩人"
            "不知過了多久，你們兩個都累壞了"
            "你坐在板凳上喘著氣，此時勝勝向你遞來了飲料"
            w "我喝過了，你用倒的吧"
            player "沒事，我不介意"
            "你們兩人坐在球場旁，就著麼看著場上的運動員們"
            "勝勝的肌膚輕貼著你，你沒有開口說話"
            "就著麼持續著好一陣子"
            w "時間差不多了，我得去找球隊朋友吃飯！"
            player "嗯！路上小心，掰掰！"
            $ w_love += 1
            jump choose_scene
        "先不要……":
            w "……好吧，以後有機會也是可以。"
            player "嗯。"
            "你們之間的氣氛變得有些尷尬"
            w "我該去跟球隊的朋友吃飯了，晚點見。"
            "勝勝很快跑遠了"
            $ w_love -= 1
            jump choose_scene

label a_reading:
    "你來到了另一棟教學大樓"
    "這裡大部分是社團教室、老師辦公室"
    "也許是新生歡迎活動的緣故，這裡的人非常少"
    "一陣風吹過，微風挾帶著花瓣迎面而來"
    "帶來一股清新的香氣，這讓你想到了Alex"
    "這時，你注意到了一間門打開的教室"
    "上頭的牌子寫著「圖書室」"
    "你好奇地往裡頭走去"
    "進入了一個由書香與文藝氣息充斥的空間，你的心情似乎寧靜了下來"
    "又一股風吹過，你向前一看，那柔順的秀髮飄逸著、熟悉的莓果香氣再次出現"
    "是Alex，他端正地坐在窗戶旁的那木桌旁"
    "他的裙襬微微被風吹地搖動，你被他的美貌驚詫到了"
    "他正專注地看著手上的書，似乎沒注意到你的到來"
    player "（我現在該幹嘛？）"
    menu:
        "先靜靜地等著，不要打斷他":
            "你就這麼靜靜地看著，你在這裡觀察到了他不同於平時的表情"
            "他時而抿起嘴、似乎感到憤懣"
            "又時而露出淺淺地微笑"
            "過了一陣子，他總算暫時停下手邊的動作"
            "他終於注意到了你，一瞬間，他露出了驚訝的表情"
            a "啊？"
            a "[player]？你怎麼在這裡……不，你不會一直站在那邊看我吧！！"
            player "啊，我想說不要打擾到你……"
            "聽到你這麼說，Alex的表情僵了一下"
            a "噗哧"
            player "！？"
            a "哈……哈哈哈！"
            "Alex突然笑了起來，他美麗動人的笑容讓你的心跳加速"
            a "你也太可愛了吧！直接叫我不就好了嗎？"
            "你羞紅了臉，有些說不出話來"
            a "不過這邊的劇情的確很精彩，謝謝你啦"
        "直接開口打招呼":
            player "Alex？你怎麼會在這裡？"


label s_cat:
        
    return

label bob_morning:
    scene bedroom
    "看來今天也是美好的一天呢！"
    
    return