label day4:
    scene cookieclass with Fade(0.5,1.0,1.5)
    w "（炫耀的貼圖）：哥們，你一定不相信，那個（號稱）冰山美人的家政老師竟然給我把到了"
    w "老師同意我使用家政教室了，你不是想追到alex嗎？要不趁這個機會烤個手工餅乾？"
    "睡眼惺忪的你聳了聳肩，答應了勝勝的邀約"
    "回完訊息後，你再度陷入了沈睡"
    "走進家政教室，勝勝一邊向你揮手，一邊露出不滿的表情"
    w "這次怎麼也遲到了？"
    menu:
        "睡過頭了，抱歉":
            w "沒事，趕快上工吧！"
        "這次也去炸...":
            w "好別說了，你要不去看個醫生吧"
    w "雖然看起來不太像，但我在烘焙這塊可是很在行的"
    w "你有什麼喜歡的口味嗎？"
    menu:
        "巧克力":
            w "我的話喜歡伯爵奶茶口味，我們就做這兩個口味吧"
        "伯爵奶茶":
            w "我的話喜歡巧克力口味，我們就做這兩個口味吧"
    "軟化奶油並加入糖粉攪拌，你的工作有點過於容易"    
    "處理完手邊的工作，你望向勝勝"
    "拌著餅乾要用的麵糊，他的衣服因汗溼而緊貼著他的肌膚，結實的線條若隱若現"
    menu:
        "有意無意地靠近勝勝，眼神時而飄到他身上。":
            "你的視線在勝勝身上遊走，肆無忌憚地將他的肌肉線條盡收眼底。"
            "但當勝勝轉過頭時，澤澤卻又像毫不在乎一般。"
            player "鋼盆我拿走囉。"
            "你輕靠在勝勝身上、伸手拿走了另一側的鋼盆。"
            "勝勝沒有開口說話，但臉頰多了一抹紅潤。"
        "男人只會影響我做餅乾的速度。":
            "你原地lock in，開啟聖人模式，如入無人之境，手速有如阿扁每秒抖6.6次。"
            "你的速度快到讓勝勝嚇了一跳。"
            w "哥們在裝弱啊，牛啊。"
            "你的速度快到讓餅乾也嚇了一跳"
            "餅乾成品量-20"
        "忍不住了，直接往他身上貼。":
            "不管三七二十一，你向勝勝使出了鐵山靠。"
            player "真香。"
            w "討厭，人家身上很多汗啦。"
            "勝勝雙手叉腰，嘴巴嘟了起來。"
    "做完餅乾，你跟勝勝走出了家政教室"
    w "沒想到你做的也不賴嘛"
    w "明天就拿去給喜歡的人吧？"
    w "...要給我的話，也不是不行啦"
    w "..."
    w "當...當我沒說！明天見！"
    jump day4_night
    
    label day4_night:
    "夕陽將街道染上了一片金黃"
    "跌宕起伏的暑輔也將步入尾聲"
    "握著手中微溫的餅乾"
    "你思考著這包餅乾的去處"
    "是靦腆的碩碩?"
    "熱情而無所畏懼的勝勝?"
    "熱愛文學的Alex?"
    "還是B̟̲̜͖̙̲̫̖̰͍̱̜̦͔̤̱̮̰͕̖̞̩̰̂̄̓͌̌̀̆̄̆̉̍̉͊͌̃̃̒͐̄͌̚ͅo͓̲̳̟͎̪̞̥̥̙̠͕̲̟̳̭̅̀̂̃̐́̂͆̌̿̇͌̑́͌̾͌̂̏ͅͅb͚̰̤̫̳̥̖͇̘͙̞͍̮͊͆͑̄̇̇̉̎̒͑̋͊̾̐̀̿̐̓̎̂̋͗̚?"
    "彷彿是在抗拒思考一般，你陷入了沈睡"